app/controllers/divisas_controller.rb

SELECT "divisas".* FROM "divisas"
---
  def index
    @divisas = Divisa.all

INSERT INTO "divisas" ("año", "mes", "dia", "valor", "created_at", "updated_at", "tipo") VALUES (?, ?, ?, ?, ?, ?, ?)  [["año", "12"], ["mes", "1"], ["dia", "1"], ["valor", "3300"], ["created_at", "2017-10-18 23:36:17.715567"], ["updated_at", "2017-10-18 23:36:17.715567"], ["tipo", "euro"]]
---
  def create
    @divisa = Divisa.new(divisa_params)

    respond_to do |format|
      if @divisa.save

SELECT  "divisas".* FROM "divisas" WHERE "divisas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_divisa
      @divisa = Divisa.find(params[:id])